Catalogs/ИА_СтратегическоеУправление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_СтратегическоеУправление</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭлемента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ТипыЭлементовСтратегическогоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдеальнаяКартина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСитуация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замысел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовНаВыполнение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПоказыватьНаРабочемСтоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ИА_ЗадачаПланаДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_ТипыЗадачАдминШкалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОВыполнении</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетОтправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаКоррЭлемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_СтратегическоеУправление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАрхива</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретРедактированияБезЗРС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКоррекция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коррекция_Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коррекция_Удаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коррекция_Добавление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коррекция_ЗРС</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ИА_ЗадачаПланаДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗависитОтЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_СтратегическоеУправление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Права</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Просмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Редактирование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ИА_АдресацияЗадачПланаДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_АдресацияЗадачПланаДействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ИА_ПраваНаОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ПраваНаОбъекты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Просмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Редактирование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_ТипыЭлементовСтратегическогоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ТипыЭлементовСтратегическогоУправления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Цель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Программа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Раздел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_СтратегическоеУправление/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИА_КСУОбщийСервер.СделатьКнопкуОсновной(Элементы.ГруппаКП, Элементы.ФормаЗаписатьЗакрыть);
	
	Право = ИА_АдминшкалаСервер.ПолучитьПравоНаОбъект(Объект.Ссылка);
	Если право=Неопределено Тогда
		Отказ = Истина;
		Сообщить("У вас нет прав на открытие данного объекта");
		возврат;
	КонецЕсли;
	
	Если Право = Перечисления.ИА_ПраваНаОбъекты.Просмотр Тогда
		ЭтаФорма.ТолькоПросмотр = истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДоступныеЭлементы()
	ДоступныеЭлементы.Очистить();
	макет = ПолучитьОбщийМакет("ИА_ДоступныеЭлементыСтратегПланирования");
	сч = 1;
	ИмяТипа = СокрЛП(Макет.Область(сч,1,сч,1).Текст);
	ДостЭл = СокрЛП(Макет.Область(сч,2,сч,2).Текст);
	Пока ИмяТипа <> "" Цикл
		Если ДостЭл <> "" Тогда
			тд = Новый ТекстовыйДокумент;
			тд.УстановитьТекст(ДостЭл);
			
			для счЭл = 1 По тд.КоличествоСтрок() Цикл
				текСтрока = СокрЛП(тд.ПолучитьСтроку(счЭл));
				Если текСтрока <> "" Тогда
					Новстр = ДоступныеЭлементы.Добавить();
					Новстр.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления[ИмяТипа];
					Новстр.ИмяЭлемента = текСтрока;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
		
		сч = сч + 1;
		ИмяТипа = СокрЛП(Макет.Область(сч,1,сч,1).Текст);
		ДостЭл = СокрЛП(Макет.Область(сч,2,сч,2).Текст);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.ТипЗадачи") и не ЗначениеЗаполнено(Объект.ТипЗадачи) Тогда
		ПоказатьПредупреждение(,"Укажите тип задачи!");
		Отказ = Истина;
		возврат;
	КонецЕсли;
	Объект.Наименование = Лев(СокрЛП(Объект.Содержание),50);
	
	ТекПольз = ТекПользователь();
	Если Объект.Права.Количество() = 1 и Объект.Права[0].Пользователь <> ТекПольз и не ПропуститьПроверку Тогда
		отказ = Истина;
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПриЗаписи", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, "В правах только 1 пользователь и он не совпадает с вами! Продолжить?", Режим, 0);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПриЗаписи(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПропуститьПроверку = истина;
        Записать();
		Закрыть();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьЭлементов()
	Для каждого элем из Элементы.ГруппаРеквизитов.ПодчиненныеЭлементы Цикл
		элем.Видимость = Ложь;	
	КонецЦикла;
	
	Отбор = новый Структура("ТипЭлемента", Объект.ТипЭлемента);
	ДостЭл = ДоступныеЭлементы.НайтиСтроки(Отбор);
	Для каждого рекв из ДостЭл Цикл
		Элементы[рекв.ИмяЭлемента].Видимость = Истина;
		Элементы.Переместить(Элементы[рекв.ИмяЭлемента], Элементы.ГруппаРеквизитов);
	КонецЦикла;
	
	Элементы.ФормаСохранитьВАрхив.Видимость = ЗначениеЗаполнено(Объект.Ссылка) и ОБъект.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.Программа;
	Элементы.ЗависитОтЗадачи.Видимость = ЗначениеЗаполнено(Объект.Ссылка) и ОБъект.ТипЭлемента = Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.Задача;
	
	Если Элементы.ЗависитОтЗадачи.Видимость Тогда
		Запрос = новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИА_СтратегическоеУправление.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ИА_СтратегическоеУправление КАК ИА_СтратегическоеУправление
		               |ГДЕ
		               |	ИА_СтратегическоеУправление.Родитель = &Родитель
		               |	И ИА_СтратегическоеУправление.ПометкаУдаления = ЛОЖЬ
		               |	И ИА_СтратегическоеУправление.Ссылка <> &Ссылка
		               |	И ИА_СтратегическоеУправление.ТипЭлемента = &ТипЭлемента";
		запрос.УстановитьПараметр("Родитель", Объект.Родитель);
		запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		запрос.УстановитьПараметр("ТипЭлемента", Перечисления.ИА_ТипыЭлементовСтратегическогоУправления.Задача);
		масс = запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ссылка");
		Элементы.ЗависитОтЗадачи.СписокВыбора.ЗагрузитьЗначения(масс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьЭлментов()
	Элементы.СоздатьЗадачу.Доступность = (НЕ ЗначениеЗаполнено(Объект.Задача)) и (не Объект.Выполнено)
										И объект.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Задача")
										и (не объект.ЭтоАрхив )
										и (не объект.ЭтоКоррекция )
										И ИА_АдминшкалаСервер.МожноВыполнитьЗадачу(Объект.Ссылка);
	
	Если Объект.ТипЭлемента = ПредопределенноеЗначение("Перечисление.ИА_ТипыЭлементовСтратегическогоУправления.Задача") Тогда
		Элементы.Выполнено.Доступность = ЗначениеЗаполнено(Объект.Ссылка) И ИА_АдминшкалаСервер.МожноВыполнитьЗадачу(Объект.Ссылка);
	КонецЕсли;
	
	ПользНаПосту = ПользовательНаПосту(Объект.УведомлятьОВыполнении);
	Элементы.ЗапретРедактированияБезЗРС.Доступность = ЗначениеЗаполнено(Объект.УведомлятьОВыполнении) и ПользНаПосту;
	Элементы.УведомлятьОВыполненииПоле.Доступность = не ЗначениеЗаполнено(Объект.УведомлятьОВыполнении) ИЛИ ПользНаПосту; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПользовательНаПосту(пПост)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_АдресацияЗадачПланаДействий.Пост
	               |ИЗ
	               |	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	               |ГДЕ
	               |	ИА_АдресацияЗадачПланаДействий.Пользователь = &Пользователь
	               |	И ИА_АдресацияЗадачПланаДействий.Пост = &Пост";
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Пост", пПост);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Следующий();
КонецФункции

&НаКлиенте
Процедура ТипЗадачиПриИзменении(Элемент)
	Объект.Содержание = Объект.ТипЗадачи;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачу(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Записать();
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Объект.Задача) И НЕ Объект.Выполнено Тогда
		Если Объект.Срок < НачалоДня(ТекущаяДата()) И ЗначениеЗаполнено(Объект.Срок) Тогда 
			ПоказатьПредупреждение(,"Крайний срок задачи не может быть меньше текущей даты.");
			Возврат;
		КонецЕсли;
		Объект.Задача = ИА_АдминшкалаСервер.СоздатьЗадачуСервер(Объект.Ответственный,Объект.Содержание, Объект.Срок, Объект.Содержание, Объект.Ссылка);
		Записать();
    КонецЕсли; 
    
	ОбновитьДоступностьЭлментов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Автор = ПолучитьТекПользователя();
	КонецЕсли;
	ЗагрузитьДоступныеЭлементы();
	ОбновитьВидимостьЭлементов();
	ОбновитьДоступностьЭлментов();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекПользователя()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

&НаКлиенте
Процедура ВыполненоПриИзменении(Элемент)
	Если Объект.Выполнено Тогда
		Объект.ДатаВыполнения = ТекущаяДата();
		Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Записать();
		КонецЕсли;
		
		Если НадоЗавершитьЗадачу(Объект.Задача) Тогда
			ИА_АдминшкалаСервер.ЗавершитьЗадачу(Объект.Задача);
		КонецЕсли;
	Иначе
		Объект.ДатаВыполнения = Дата(1,1,1);
		Объект.ОтчетОтправлен = ложь;
    КонецЕсли;
		
	ОбновитьДоступностьЭлментов();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекПользователь()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

&НаСервереБезКонтекста
Функция НадоЗавершитьЗадачу(пЗадача)
	Возврат (не пЗадача.Пустая()) и не пЗадача.Выполнена;
КонецФункции

&НаКлиенте
Процедура ТипОбъектаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	массивПодч = ИА_АдминшкалаСервер.ПолучитьВозможныхПодчиненныхТипов(Объект.Родитель);
	Элемент.СписокВыбора.ЗагрузитьЗначения(массивПодч);
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьВАрхивНаСервере(программа)
	АрхивПрограммы = Справочники.ИА_СтратегическоеУправление.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(АрхивПрограммы, программа, ,"Код, Ссылка, Владелец");
	АрхивПрограммы.ЭтоАрхив = истина;
	АрхивПрограммы.СсылкаНаКоррЭлемент = программа; 
	АрхивПрограммы.ДатаАрхива = ТекущаяДата();
	АрхивПрограммы.Наименование = "[Архив от "+ТекущаяДата()+"] " + АрхивПрограммы.Наименование;
	АрхивПрограммы.Содержание = "[Архив от "+ТекущаяДата()+"] " + АрхивПрограммы.Содержание;
	АрхивПрограммы.Права.Загрузить(программа.Права.Выгрузить());
	АрхивПрограммы.Записать();
	
	СкопироватьЭлементы(программа, АрхивПрограммы.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СкопироватьЭлементы(изПрограммы, вПрограмму)
	Выборка = Справочники.ИА_СтратегическоеУправление.Выбрать(изПрограммы);
	Пока Выборка.Следующий() Цикл
		НовЭлемент = Справочники.ИА_СтратегическоеУправление.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НовЭлемент, Выборка, ,"Код, Ссылка, Родитель, Владелец");
		НовЭлемент.ЭтоАрхив = истина;
		НовЭлемент.Родитель = вПрограмму;
		НовЭлемент.Права.Загрузить(Выборка.Права.Выгрузить());
		НовЭлемент.Записать();	
		
		СкопироватьЭлементы(Выборка.Ссылка, НовЭлемент.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВАрхив(Команда)
	СохранитьВАрхивНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура УведомлятьОВыполненииПолеПриИзменении(Элемент)
	Если не ЗначениеЗаполнено(Объект.УведомлятьОВыполнении) ТОгда
		Объект.ЗапретРедактированияБезЗРС = ложь;
	КонецЕсли;
	ОбновитьДоступностьЭлментов();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ЗависитОтЗадачиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
